[
    {
        "name": "Steven C. Hayes, PhD",
        "about": "clinical psychologist, ACT developer and long-standing researcher on process-based therapy and relational frame theory.",
        "bio": "Welcome.\nI’m a psychologist, researcher, originator of Acceptance and Commitment Therapy, Relational Frame Theory, and co-developer of Process-Based Therapy. I’ve spent the past four decades studying how to ease human suffering and empower people towards a values-based life.",
        "articleName": "How to Love Yourself With All Your Flaws And Shortcomings:Learning to Let Go of Who You “Should” Be",
        "article": "We all wear various masks to conceal ourselves. If you’ve ever greeted a neighbor you’d rather not talk to, you know exactly what I mean. You smile even though you don’t feel like smiling. You may ask about their day, even though you don’t really care. And you maintain eye contact, nodding along to their seemingly never-ending story, even though mentally you’ve already checked out and wandered off.\n\nWearing these masks can sometimes feel dishonest or even “fake,” but they are essential to our life as social animals. They’re the glue holding together relationships and whole communities, reconciling our own needs with those of others. Without these subtle acts of self-restraint and performance, social life could become chaotic, marked by unfiltered exchanges that strain relationships and erode trust. In some ways, masking ourselves is less about deceit and more about choosing approximations of kindness and attentiveness when we actually feel like neither.\n\nBut there’s another type of mask we often wear, subtler yet deeply ingrained in our psychology. These masks are shaped by expectations about how we should behave, look, or even feel. And if left unchecked, they can cause notable hurt and pain.\n\nThe Stories We Believe About Ourselves\nWe all have internalized stories about who we are and who we should be. \n\nSome of them come from cultural expectations; societal beliefs about what it means to live a “successful” or “acceptable” life. While rarely spelled out explicitly, they saturate our policies, schools, movies, art, and even marketing campaigns. Until recently, for instance, promotional ads often portrayed the “ideal family” as white, heteronormative, and suburban. Boys are expected to be strong and stoic like James Bond, while girls are taught to be pretty and pleasant like Barbie. The influence of such cultural stereotypes is everywhere.\n\nThen there are social expectations – the roles we unconsciously step into as children and carry into adulthood. Maybe you grew up as “the responsible one,” always expected to take care of your siblings. Or perhaps you were “the class clown,” trying to make others laugh to win their approval. These roles can shape how you see yourself for decades, dictating what you pursue and how you handle failure or success.\n\nFinally, there are personal expectations, often influenced by cultural and social pressures but also your own individual history. They might sound like, “I should have everything figured out by now,” or “I must always be kind and selfless.” These internalized demands can make it feel like you’re in a constant battle with yourself – perpetually falling short of some ideal that may not even align with what you truly want.\n\nThe Suffocating Weight of “Should”\nThe word “should” might seem innocuous, but can become a heavy burden when used without care. Because underneath is often a rigid standard that leaves little room for self-compassion or flexibility. More specifically, when you live by “should,” you’re more likely to:\n\nOverlook your needs: Constantly prioritizing other people’s wishes can leave you disconnected from your own desires.\nFear failure: Perfectionism thrives on “should” statements, creating anxiety over whether you’re measuring up.\nFeel inauthentic: The more you try to live up to other people’s standards, the more you move away from your own.\nThe weight of “should” can manifest itself in various ways: stress, burnout, low self-esteem, or a lingering sense of dissatisfaction with life. And while self-improvement culture often markets the idea of “fixing” these flaws, the truth is, you don’t need fixing. \n\nYou need freeing.\n\nThe Courage to Love Yourself\nLetting go of who you “should” be doesn’t mean abandoning self-discipline or refusing to grow. Instead, it’s about cultivating the courage to embrace who you are – flaws, quirks, and all. It’s about releasing the grip of societal, familial, and personal “shoulds” to make space for a more authentic, values-driven life. Here’s how you can begin that process:\n\nNotice Your Masks\n\nStart by observing the roles and expectations you’ve been playing into. When do you feel most compelled to act a certain way or hide certain parts of yourself? For example, do you avoid sharing your struggles because you fear being seen as weak? Or do you say yes to every favor, even when it’s inconvenient, because you fear disappointing others? Journaling about these patterns can help you gain clarity on the masks you wear and why.\n\nPractice Self-Compassion\n\nIt’s easy to feel frustrated when you notice how much time you’ve spent chasing external approval. But instead of judging yourself, try to meet these realizations with kindness. Remind yourself that these masks were often created out of a desire to belong, feel safe, or meet the expectations of people you love. One helpful practice is to imagine speaking to yourself the way you would to a close friend. You wouldn’t shame them for struggling; you’d offer support and encouragement.\n\nClarify Your Values\n\nWhile expectations often come from external sources, values come from within. Take time to reflect on what truly matters to you – not what you think should matter, but what lights you up. Do you value creativity, kindness, adventure, or honesty? Again, journaling about this question may give you important insights. Your values serve as a compass, helping you navigate life in a way that feels meaningful and authentic.\n\nTake Small, Brave Steps\n\nLiving authentically doesn’t mean tearing down every mask overnight. It means making small, intentional choices that align with your values. Maybe it’s speaking up when you disagree with a friend, even if it feels uncomfortable. Or maybe it’s allowing yourself to rest without guilt, knowing that self-care is a valid need. Each step you take reinforces the belief that you are worthy, not because you meet some external standard, but because you exist.\n\nThe Beauty of Imperfection\nAs you let go of who you “should” be, you’ll find something remarkable: your imperfections are not liabilities – they are part of your humanity. The cracks in your armor are where authenticity shines through, inviting deeper connections and a greater sense of freedom.\n\nSo the next time you catch yourself striving to be who you think you “should” be, pause. Breathe. And remember: you are enough, just as you are. When you learn to love yourself with all your flaws and shortcomings, you open the door to a life not of perfection, but of wholeness. And that is a life worth living.",
        "articleDate": "30-Nov-24",
        "therapistField": "Acceptance & Commitment Therapy (ACT)"
    },
    {
        "name": "Sue (Susan) Johnson, EdD",
        "about": "developer of EFT, clinician and researcher in couple\/family therapy and attachment-based interventions",
        "bio": "Stay connected with Dr. Sue Johnson’s inspiring legacy by following our social media channels. Get the latest updates on her work, upcoming resources, and how her transformative teachings continue to grow and impact relationships worldwide.",
        "articleName": "Effectiveness of digital interventions\non relationship satisfaction among couples:\na systematic review and meta-analysis",
        "article": "With the advent of the Internet and digital technologies, these tools have increasingly been integrated into\nthe field of psychology, enabling professionals to deliver\nservices and implement interventions through digital\nmeans. However, the terminology for these interventions is inconsistent across the literature. Many authors\nuse various terms including online, web-based, internetbased, eHealth etc. In addition, mobile applications and\nother digital devices are often used as platforms for delivering these interventions. Given this conceptual ambiguity, we consider it essential to clarify the terminology and\nprovide a clear definition of digital interventions.\nIn a comprehensive review focused on defining internet-supported therapeutic interventions [23] digital\ninterventions are divided into four main following categories: (1) web-based interventions; (2) online counseling\nand therapy; (3) internet-operated therapeutic software;\nand (4) other online activities. Given that our systematic review does not focus on online counseling or other\nonline activities, such as blogs, podcasts, or support\ngroups, we consider it most relevant to elaborate primarily on the first and third categories.\nWeb-based interventions are defined as primarily selfguided, structured programs delivered through websites,\ndesigned to promote psychological or health-related\nchange using evidence-based content and interactive\nfeatures. At the same time the authors divide web-based\nintervention into three subtypes such as: (1) web-based\neducation interventions; (2) self-guided web-based therapeutic interventions; and (3) human-supported webbased therapeutic interventions. These interventions\nare typically characterized by four core components: (1)\nthe nature of the content, which may be educational or\nfocused on facilitating therapeutic change; (2) the use of\nvarious multimedia formats such as text, images, audio,\nvideo, or animations to deliver the content; (3) the level\nof interactivity, including features like self-assessment\ntools; and finally, (4) the presence of guidance and feedback provided to users throughout the intervention. The\ncategory of internet-operated therapeutic software is\ndescribed as involving interventions that utilize advanced\ncomputer capabilities, including artificial intelligence, to\ndeliver therapy through means such as dialogue-based\nvirtual therapists, rule-based expert systems, or interactive environments like therapeutic games and 3D virtual\nspaces [",
        "articleDate": "06-Feb-17",
        "therapistField": "Couples & Attachment (Emotionally Focused Therapy, EFT)"
    },
    {
        "name": "Bessel A. van der Kolk, MD",
        "about": "psychiatrist, clinician and trauma researcher (author of The Body Keeps the Score; runs the Trauma Research Foundation)",
        "bio": "​Bessel van der Kolk MD spends his career studying how children and adults adapt to traumatic experiences, and has translated emerging findings from neuroscience and attachment research to develop and study a range of treatments for traumatic stress in children and adults.\n\nIn 1984, he set up one of the first clinical\/research centers in the US dedicated to study and treatment of traumatic stress in civilian populations, which has trained numerous researchers and clinicians specializing in the study and treatment of traumatic stress, and which has been continually funded to research the impact of traumatic stress and effective treatment interventions. He did the first studies on the effects of SSRIs on PTSD; was a member of the first neuroimaging team to investigate how trauma changes brain processes, and did the first research linking BPD and deliberate self-injury to trauma and neglect in early childhood.",
        "articleName": "Treating Posttraumatic Stress Disorder: The Complexities of the Clinical Realm",
        "article": "Introduction\nA number of evidence-based psychological and pharmacological treatments for posttraumatic stress disorder (PTSD) are available today . However, many trauma survivors do not have PTSD alone but suffer from various comorbidities. Moreover, patients’ priorities frequently differ from their therapists’ therapeutic strategies. In other words, clinical reality is usually much more complex than research evidence appears to suggest. Thorough training in trauma-focused psychotherapy  is essential, as is knowledge about effective pharmacological approaches. However, clinical wisdom may be as important. The therapist needs to be skilled in listening to their patient and building up a mutually trusting therapeutic relationship. They also must be able to honestly engage in shared decision-making while at the same time being straightforward in guiding the patient so that they can jointly develop consensus regarding the therapeutic steps to take .PTSD\nSix weeks have passed since Anna’s death. John feels somewhat stabilized. He has acquired a set of emotion regulation skills such as going for a walk when he is distressed. However, he still has frequent flashbacks and nightmares. He persistently avoids external reminders of Anna’s death, such as visiting her grave at the cemetery. John keeps blaming himself for not having been able to save Anna’s life. He is hypervigilant, has difficulties concentrating, and suffers from insomnia. In other words, John fulfills the diagnostic criteria for PTSD [9]. In addition, John has moderate major depressive disorder. He is in a depressed mood most of the time, experiences great loss of energy, and feels completely worthless.\n\nOf note, John does not feel sad about having lost Anna. Instead, he is constantly haunted by his guilt feelings. Whenever he is reminded of the incident, he immediately jumps to the idea of being responsible for her death. He spends hours ruminating: “If only I was a doctor, I could have applied the Heimlich maneuver, thus rescuing her!” (the Heimlich maneuver is a medical emergency procedure which can relieve foreign body airway obstruction if applied timely and properly). John’s guilt feelings are additionally fueled by the little argument the couple had had upon his arrival at home: “If we had not argued over the problem with the door keys, she would not have been so stressed out, and thus would not have gagged on the burger bite!”.\n\nJohn also suffers from a number of physical health issues: he has high blood pressure, is moderately overweight, and his blood glucose levels are borderline elevated. While focusing on the psychiatric and psychological aspects of his crisis, I am taking these physical issues into account, considering that the psychosocial stress John is currently exposed to may have elevated his preexisting allostatic load to allostatic overload",
        "articleDate": "May-24",
        "therapistField": "Trauma \/ PTSD \/ developmental trauma"
    },
    {
        "name": "Michelle G. Craske, PhD",
        "about": "clinical psychologist and active researcher on anxiety disorders and treatment implementation.",
        "bio": "Michelle G. Craske, Ph.D., AO is a Distinguished Professor of Psychology, and of Psychiatry and Biobehavioral Sciences, Kevin Love Fund Centennial Chair, and Director of the Anxiety and Depression Research Center at the University of California, Los Angeles. She is also co-director of the UCLA Depression Grand Challenge. She has published extensively in the area of fear, anxiety and depression",
        "articleName": "Cognitive-Behavioral Therapy for\nthe Treatment of Anxiety Disorders",
        "article": "here is consistent evidence that cognitive-behavioral\ntherapy (CBT) is an effective first-line strategy for the treatment of anxiety disorders. There is also evidence, \nparticularly for the treatment of panic disorder, that CBT is\nan effective strategy for pharmacotherapy nonresponders,\na replacement strategy for patients who wish to discontinue\ntheir medications, and a standard strategy for pharmacotherapy patients who need to boost their treatment response. In this article, we consider each of these applications of CBT and discuss some of the complex issues that\nare encountered for the combination of pharmacologic and\ncognitive-behavioral treatment strategies. Prior to considering these roles, however, it is important to first consider\nthe nature of CBT interventions.\nFor the pharmacologic treatment of anxiety disorders,\nthere is ample evidence that patients can improve on treatment with selective serotonin reuptake inhibitors (SSRIs),\ntricyclic antidepressants, benzodiazepines, and monoamine\noxidase inhibitors.1,2 These medications most likely exert\ntheir action by attenuating the anxiety elicited by the feared\ncues associated with each disorder (e.g., social interactions\nfor patients with social anxiety disorder3\n), but in many\ncases, this attenuation of anxiety lasts only as long as medication is continued. With medication discontinuation, relapse is common (e.g., results in panic disorder2,4,5), although relapse rates are reduced when treatment is maintained for a longer period before discontinuation.",
        "articleDate": "11-Jun-19",
        "therapistField": "Anxiety & depression (exposure therapy, mechanisms of fear)"
    },
    {
        "name": "Cynthia M. Bulik, PhD",
        "about": "clinical psychologist, founding director of UNC’s Center of Excellence for Eating Disorders and a major researcher in genetics & treatment of eating disorders",
        "bio": "Dr. Bulik, a clinical psychologist, is Distinguished Professor of Eating Disorders in the Department of Psychiatry, professor of nutrition in the Gillings School of Global Public Health and founding director of the UNC Center of Excellence for Eating Disorders. She is a recipient of the Eating Disorders Coalition Research Award, the Academy for Eating Disorders' Leadership Award for Research, the Price Family National Eating Disorders Association Research Award and the Women’s Leadership Council Faculty-to-Faculty Mentorship Award.",
        "articleName": "A comparative neuropsychological\nassessment of anorexia nervosa, bulimia\nnervosa, binge eating disorder and healthy\ncontrol",
        "article": "The two primary diagnostic frameworks for Eating disorders (EDs) are the International Classification of Diseases\n(ICD) , which is in its 10th edition, and the Diagnostic and Statistical Manual of Mental Disorders, 5th edition [DSM-5; American Psychiatric Association . The\nDSM-5 is more commonly utilized in research, including\nepidemiological studies. It identifies five primary EDs:\nAnorexia Nervosa (AN), Bulimia Nervosa (BN), Binge\nEating Disorder (BED), Avoidant\/Restrictive Food Intake\nDisorder (ARFID), and Other Specified Feeding and Eating Disorders (OSFED) . Eating disorders (EDs) are\nserious psychiatric conditions marked by persistent disruptions in eating behavior, body image disturbances,\nand maladaptive cognitions about food and weight. EDs\ndisproportionately affect young women, with prevalence\nestimates ranging from 5.5% to 17.9% compared to 0.6%\nto 2.4% in men, and recent evidence suggests rising rates,\nparticularly among adolescents and young adults [3–6].\nLarge-scale surveys confirm that ED risk is especially\nhigh in university populations [7], Hasan et al., 2023),\nwith symptoms often emerging between ages 18 and 21\nand including restrictive eating, binge eating, purging,\nand weight-related concerns [8, 9]. Untreated EDs are\nassociated with a twofold increase in mortality risk and\nsubstantial psychiatric and medical comorbidities [10].\nPsychiatric comorbidity is a defining feature of EDs.\nDepression, anxiety, and stress frequently co-occur, exacerbating both functional impairment and illness severity [5, 11, 12]. Personality traits such as self-control and\nemotional dysregulation further shape symptom expression and treatment outcomes [13], Sander et al., 2021).\nInsomnia is particularly common in AN and BN, and\naccumulating evidence indicates that poor sleep not only\nworsens affective symptoms but als",
        "articleDate": "02-Jul-25",
        "therapistField": "Eating disorders"
    },
    {
        "name": "Gabor Maté, MD",
        "about": "physician and clinician who has written and lectured widely on trauma’s role in addiction and mental\/physical health (clinical\/practice background).",
        "bio": "Gabor Maté CM ( born January 1944) is a Canadian physician and author. He has worked in family practices and specializes in childhood development and trauma,[2] including long-term effects on physical and mental health, such as autoimmune diseases, cancer, Attention Deficit Hyperactivity Disorder (ADHD),[3] and addiction.",
        "articleName": "Trauma-Informed Care in Addiction: A Holistic Approach to Recovery",
        "article": "Trauma-informed care in addiction treatment\n\nTrauma-informed care is an approach to treatment that recognizes the high prevalence of trauma in individuals with substance use disorders and integrates trauma awareness into the therapeutic process. TIC is not a specific treatment modality but rather a framework that can be applied to various therapeutic techniques. The core principles of TIC include:\n\nSafety: Creating a physically and emotionally safe environment is paramount in trauma-informed care. In addiction recovery, this means establishing a setting where individuals feel protected from both physical harm and emotional re-traumatization. This may involve providing a secure treatment space and building rapport with patients to reduce feelings of fear or anxiety .\n\nTrustworthiness and Transparency: TIC emphasizes the importance of building trust between the patient and the provider. Transparency about treatment processes, expectations, and the purpose of interventions fosters trust and allows individuals to feel more comfortable and engaged in the recovery process .\n\nPeer Support: Peer support is crucial in trauma-informed care. In the context of addiction, peer support groups and shared experiences can help individuals feel understood and less isolated. Connecting with others who have experienced similar traumas can be empowering and facilitate healing.\n\nChoice and Empowerment: Trauma-informed care emphasizes patient autonomy and decision-making. Providing individuals with options and allowing them to participate in their treatment planning helps them regain a sense of control, which is often lost in the aftermath of trauma .\n\nCollaboration and Mutuality: TIC encourages a collaborative approach between patients and providers, recognizing that recovery is a shared journey. This principle fosters a sense of partnership in the treatment process, where individuals feel valued as active participants in their recovery.\n\nCultural, Historical, and Gender Sensitivity: Trauma-informed care acknowledges that trauma can affect individuals differently based on their cultural, historical, and gender-related experiences. Effective addiction treatment requires an awareness of these differences and a culturally sensitive approach to care.\n\nResilience and Recovery: Rather than focusing on the pathology of addiction and trauma, TIC emphasizes resilience and the capacity for recovery. This approach highlights individuals’ strengths and resources, supporting their journey toward healing and long-term recovery .",
        "articleDate": "31-Jan-25",
        "therapistField": "Addiction, trauma-informed care"
    },
    {
        "name": "Tony Attwood, PhD",
        "about": "clinical psychologist and researcher, runs a private diagnostic\/treatment practice while publishing extensively on autism spectrum conditions.",
        "bio": "Anthony John Attwood (born 9 February 1952) is a British psychologist notable for his work on level one autism, previously known as Asperger’s syndrome. He resides in Queensland, Australia, where he is an associate professor at Griffith University",
        "articleName": "Asperger syndrome and anxiety disorders (PAsSA): a pilot multicentre, single-blind randomised trial of group cognitive–behavioural therapy",
        "article": "1. Social Phobia Inventory. This is a 17-item self-report measure of behavioural, physiological and cognitive symptoms associated with social phobia.19 Participants rate the frequency with which they experience each symptom over the last week, using a 5-point Likert-type scale (0–4).\n\n2. Liebowitz Social Anxiety Scale. This instrument is a self-report scale that assesses fear and avoidance throughout 24 listed situations, which are likely to elicit social anxiety.20\n\n3. Social and Emotional Functioning Interview (Informant and Subject Versions). This is a semi-structured clinician-rated assessment of everyday social and psychiatric functioning that was designed to assess independence, leisure, interpersonal problems, employment and social relationships.21 Some items are shared with the Autistic Diagnostic Observation Schedule. This measure was completed with each participant and a nominated informant.\n\n4. Social Interaction Anxiety Scale. A self-report 20-item measure of anxiety as experienced in social situations associated with social anxiety and social phobia in accordance to the DSM-IV criteria.22,23 Experiences are rated on a 5-point scale from 0 (not at all characteristic of me) to 4 (extremely characteristic of me).\n\n5. Fear Questionnaire. A self-report questionnaire regarding the individual perception of fears and phobias; respondents are asked how likely they are to avoid each of the listed situations, due to anxiety\/fear or any other unpleasant feelings.24 In addition to the 15 pre-existing items the individual is asked to document and score any individual phobias they would wish treated.\n\n6. Hamilton Rating Scale for Depression. This structured clinician-rated interview is considered a valid indicator of depression and the ratings are based on the interviewer’s objective and subjective perceptions during the assessment.25 Eight items are scored on a 0 (not present) to 4 (severe) point scale, and nine items are scored from 0 to 2 (levels of severity)",
        "articleDate": "13-Apr-16",
        "therapistField": "Autism \/ Asperger’s (diagnosis & clinical interventions)"
    }
]